{
  "overall_outcome": "REMAND",
  "issues": [
    {
      "issue_id": 1,
      "description": "Whether the periodic reviews of Walker's administrative segregation status from 2014 to 2019 were constitutionally meaningful under the Due Process Clause.",
      "standard_of_review": "de novo",
      "holding": "REMAND",
      "key_reasoning": "The court found that, construing the evidence in the light most favorable to Walker, a reasonable jury could conclude that the reviews he received were not constitutionally meaningful, as they appeared rote, failed to engage with his improved behavior, and may have been pretextual; thus, summary judgment for defendants was inappropriate and the case must be remanded for further proceedings."
    },
    {
      "issue_id": 2,
      "description": "Whether the defendant prison officials are entitled to qualified immunity for their conduct in reviewing Walker's administrative segregation status.",
      "standard_of_review": "de novo",
      "holding": "REMAND",
      "key_reasoning": "The court held that it was premature to grant qualified immunity at the summary judgment stage because genuine issues of material fact exist as to whether Walker's right to meaningful review was violated, and the law was clearly established that such review is required."
    }
  ],
  "key_precedents": [
    "Hewitt v. Helms, 459 U.S. 460 (1983)",
    "Proctor v. LeClaire, 846 F.3d 597 (2d Cir. 2017)",
    "Taylor v. Rodriguez, 238 F.3d 188 (2d Cir. 2001)",
    "Mathews v. Eldridge, 424 U.S. 319 (1976)",
    "Sandin v. Conner, 515 U.S. 472 (1995)"
  ],
  "difficulty_signals": {
    "novel_legal_question": false,
    "circuit_split": false,
    "close_case": true,
    "fact_intensive": true
  },
  "has_dissent": true,
  "summary_text": "Tyrone Walker has spent more than nineteen years in solitary confinement in New York prisons. His incarceration began in 1994, after he was convicted of committing three brutal crimes: two murders, and an armed robbery. In 2000, after six years in the custody of New York’s Department of Corrections and Community Supervision (“DOCCS”), 2 Walker committed another egregiously violent crime, attacking the Deputy Superintendent of Security (“DSS”) with an ice pick and a knife in the Green Haven prison yard. The DSS was seriously injured and other correctional officers were also injured in the assault. As punishment for the brutal attack that he carried out in the prison, DOCCS imposed on Walker an approximately fourteen-year term of “Disciplinary Segregation.” Walker served that term, from 2000-2014, under solitary confinement conditions in the Special Housing Units (the “SHUs”) of state prison facilities.\n\nWhen Walker’s term of punitive Disciplinary Segregation ended in 2014, DOCCS did not release him from the SHU. Instead, it designated him for “Administrative Segregation” (“Ad Seg”)—an indeterminate status that is based on predicted behavior. To designate a person for Ad Seg, DOCCS officials must first decide that returning that person to the general prison population would pose a risk to the safety and security of the facility. See 7 N.Y.C.R.R. § 301.4(b).\n\nAfter making that determination and designating Walker for Ad Seg, DOCCS transferred him to Upstate Correctional Facility (“Upstate”), a specialized prison where SHU cells made up 80% of the facility’s housing. When the record in this case closed in 2019—nineteen years after the prison yard attack—Walker was still there. Defendants advise the Court that he remained in the SHU until March 2022, around the time new statutory provisions governing the use of segregated housing came into effect in New York state detention facilities; Walker was then transferred to a step-down facility. See DOCCS Br. 22. 3\n\nThe physical and psychological hardship faced by individuals in solitary confinement has regularly been recognized by the courts and by international bodies. The “[y]ears on end of near-total isolation exact a terrible price” and, in many cases, induce severe psychiatric symptoms. Davis v. Ayala, 576 U.S. 257, 286–90 (2015) (Kennedy, J., concurring). Solitary confinement can also cause physical harm, both due to “high rates of suicide and self-mutilation” and “the lack of opportunity for free movement” causing “more general physical deterioration.” Williams v. Sec’y Pennsylvania Dep’t of Corr., 848 F.3d 549, 567–68 (3d Cir. 2017) (footnotes omitted). State legislatures, the ABA, and international organizations have recognized these harms and worked to prevent overuse of the practice. See, e.g., S. S2836, 2021–2022 Leg. Reg. Sess. (N.Y. 2021); Am. Bar Assoc., Treatment of Prisoners, ABA Standards for Crim. J. Third Edition, § 23-3.8 (2011); United Nations Gen. Assembly, Interim report of the Special Rapporteur of the Human Rights Council on torture and other cruel, inhuman or degrading punishment or treatment, U.N. Doc. A/66/268, ¶ 70 (Aug. 5, 2011).\n\nIn view of these documented extreme effects, courts have regularly held that the Due Process Clause protects incarcerated individuals against the unjustified use of solitary confinement—particularly when its stated purpose is prevention, not punishment. Hewitt, 459 U.S. at 477 n.9; Proctor, 846 F.3d at 610–11; see H’Shaka, 758 F. App’x at 199. Due process requires prison officials to undertake “periodic review[s]” to determine whether a person designated in Ad Seg “remains a security risk.” Hewitt, 459 U.S. at 477 n.9. Those reviews must be “meaningful”—that is, their results must not be pre-ordained; in each, prison officials must actually attempt to assess and then consider the individual’s current threat level and any changes in their behavior. Proctor, 846 F.3d at 610–11. The ultimate determination whether to continue imposing solitary conditions or to return a person to the main prison population must be based on considerations of present and future institutional safety and security, not on a desire to continue to punish the person for past misconduct. Id.\n\nDuring Walker’s five years of Ad Seg in the Upstate SHU, which began in 2014, DOCCS officials completed forty-six reviews of his Ad Seg status, each following a three-tiered process described further below. On each occasion from 2014 through 2019, the review report recited the violent assaults that Walker committed in 1993 and 2000 and various prison-rule infractions in those and intervening years before concluding that Walker still posed a risk to the safety and security of the facility and that he could not be safely returned to the general prison population. Those may have been reasonable determinations; we owe them considerable deference. Under Hewitt and Proctor, however, the relevant inquiry is not whether DOCCS’s conclusions were reasonable; it is whether the process used to reach those conclusions was constitutionally meaningful."
}