{
  "overall_outcome": "REMAND",
  "issues": [
    {
      "issue_id": 1,
      "description": "Whether an employee’s ability to perform the essential functions of her job without a reasonable accommodation is fatal to her failure-to-accommodate claim under the ADA",
      "standard_of_review": "de novo",
      "holding": "REVERSE",
      "key_reasoning": "The court held that the ADA’s plain text defines a qualified individual as one who can perform essential job functions with or without reasonable accommodation, so ability to perform without accommodation is relevant but not dispositive to a failure-to-accommodate claim."
    }
  ],
  "key_precedents": [
    "Woolf v. Strada, 949 F.3d 89 (2d Cir. 2020)",
    "Natofsky v. City of New York, 921 F.3d 337 (2d Cir. 2019)",
    "McBride v. BIC Consumer Prods. Mfg. Co., 583 F.3d 92 (2d Cir. 2009)",
    "Borkowski v. Valley Cent. School Dist., 63 F.3d 131 (2d Cir. 1995)",
    "Noel v. N.Y.C. Taxi & Limousine Comm’n, 687 F.3d 63 (2d Cir. 2012)",
    "Hill v. Assocs. for Renewal in Educ., Inc., 897 F.3d 232 (D.C. Cir. 2018)",
    "Bell v. O’Reilly Auto Enters., LLC, 972 F.3d 21 (1st Cir. 2020)",
    "Feist v. Louisiana, 730 F.3d 450 (5th Cir. 2013)",
    "Sanchez v. Vilsack, 695 F.3d 1174 (10th Cir. 2012)",
    "Buckingham v. United States, 998 F.2d 735 (9th Cir. 1993)"
  ],
  "difficulty_signals": {
    "novel_legal_question": false,
    "circuit_split": false,
    "close_case": false,
    "fact_intensive": true
  },
  "has_dissent": false,
  "summary_text": "Angel Tudor, a teacher, appeals from a judgment of the United States District Court for the Northern District of New York (Sharpe, J.), entered on March 21, 2023, granting summary judgment in favor of Whitehall Central School District on Tudor’s failure-to-accommodate claim brought pursuant to the Americans with Disabilities Act. We conclude that the district court erred by holding that an employee’s ability to perform the essential functions of her job without a reasonable accommodation is fatal to her failure-to-accommodate claim. Accordingly, we vacate the judgment of the district court and remand for further proceedings consistent with this opinion."
}