{
  "overall_outcome": "REVERSE",
  "issues": [
    {
      "issue_id": 1,
      "description": "Whether summary judgment was properly granted to Defendants on Dr. Byrnes's Title VII retaliation claim based on his termination.",
      "standard_of_review": "de novo",
      "holding": "REVERSE",
      "key_reasoning": "The court found that a reasonable jury could conclude Dr. Byrnes established a prima facie case of retaliation and pretext under the McDonnell Douglas framework, particularly given evidence of an unfair investigation and temporal proximity between protected activity and termination."
    },
    {
      "issue_id": 2,
      "description": "Whether summary judgment was properly granted to Defendants on Dr. Byrnes's Title VII retaliation claim based on Defendants' reporting of his cases to the Kansas Board of Healing Arts (KBHA).",
      "standard_of_review": "de novo",
      "holding": "REVERSE",
      "key_reasoning": "The court held that Dr. Byrnes presented sufficient evidence of causation and pretext, including disparate treatment compared to similarly situated doctors and reporting a non-mandatory case, to survive summary judgment."
    },
    {
      "issue_id": 3,
      "description": "Whether the district court properly declined to exercise supplemental jurisdiction over Dr. Byrnes's state law claims after dismissing his federal claims.",
      "standard_of_review": "abuse of discretion",
      "holding": "REMAND",
      "key_reasoning": "Because the federal claims are reinstated, the court remanded for the district court to reconsider whether to exercise supplemental jurisdiction over the state law claims."
    }
  ],
  "key_precedents": [
    "McDonnell Douglas Corp. v. Green, 411 U.S. 792 (1973)",
    "Sellman v. Aviation Training Consulting, No. 23-6138, --- F.4th ---, 2025 WL 2957951 (10th Cir. Oct. 21, 2025)",
    "Thomas v. Berry Plastics Corp., 803 F.3d 510 (10th Cir. 2015)",
    "Smothers v. Solvay Chems., Inc., 740 F.3d 530 (10th Cir. 2014)",
    "Bekkem v. Wilkie, 915 F.3d 1258 (10th Cir. 2019)"
  ],
  "difficulty_signals": {
    "novel_legal_question": false,
    "circuit_split": false,
    "close_case": true,
    "fact_intensive": true
  },
  "has_dissent": false,
  "summary_text": "Dr. Matthew Byrnes brought retaliation claims under Title VII of the Civil Rights Act of 1964 against his former joint employers—St. Catherine Hospital (“SCH”) and Centura Health Corporation (“Centura”) (collectively, “Defendants”)—for firing him and later reporting him to the Kansas medical licensing board. He alleged Defendants retaliated because he reported that another doctor working at SCH was sexually harassing nurses.\n\nThe district court granted summary judgment to Defendants on Dr. Byrnes’s federal claims and declined to exercise supplemental jurisdiction over his related state law claims. Exercising jurisdiction under 28 U.S.C. § 1291, we reverse and remand.\n\n                                   I. BACKGROUND\n\n       We provide a brief factual summary and procedural history here and later discuss additional details as relevant to the issues on appeal.\n\n                       A. Key Participants and Factual Summary 1\n\n       Centura is a not-for-profit corporation headquartered in Colorado. It operates a regional healthcare network. SCH, located in Garden City, Kansas, is a Centura member hospital. Centura manages the clinical practices of SCH, including personnel matters.\n\n       Dr. Byrnes is a medical doctor licensed to practice medicine in Kansas by the Kansas Board of Healing Arts (“KBHA”). He worked as a general surgeon and intensivist at SCH from 2012 until February 12, 2020. He also served as SCH’s Chief Medical Officer (“CMO”) from 2013 to June 2019. Centura and SCH jointly employed Dr. Byrnes.\n\n       Many individuals were involved in this case. The following played significant roles:\n\n       • Dr. William Freund, President of SCH’s Medical Executive Committee (“MEC”)\n\n       • Dr. Bryan Stucky, MEC Vice President and later President\n\n       • Dr. Toni Green-Cheatwood, Centura Colorado Kansas Group (“CKG”) Vice President and Physician Executive\n\n       • Peter Sabey, Centura General Counsel\n\n       • Dr. Scott Lichtenberger, Centura President\n\n       • Tom Gessel, CKG Group President\n\n       • Scott Taylor, SCH Chief Executive Officer (“CEO”)\n\n       • Nancy Killion, Centura Director of Quality\n\n       On August 31, 2019, Dr. Byrnes reported Dr. Kurt Kessler, a doctor working at SCH, for sexual harassment. Dr. Freund investigated. Dr. Freund, Dr. Stucky, and Dr. Green-Cheatwood informed Dr. Byrnes that his allegations lacked merit.\n\n       After receiving a subpoena from the KBHA about a complaint filed against Dr. Byrnes, Dr. Green-Cheatwood and Mr. Sabey conducted an internal investigation. They interviewed various doctors, but not Dr. Byrnes or any nurses. They reported their investigation results and Dr. Green-Cheatwood recommended firing Dr. Byrnes to Dr. Lichtenberger and Mr. Gessel, who jointly decided to fire Dr. Byrnes.\n\n       After firing Dr. Byrnes, SCH referred some of Dr. Byrnes’s cases to an outside peer review committee at Centura’s St. Anthony’s Hospital in Colorado, which reviewed and scored Dr. Byrnes’s cases. Defendants reviewed St. Anthony’s findings and reported four of Dr. Byrnes’s cases to the KBHA for possible disciplinary action.\n\n                                   B. Procedural History\n\n       Dr. Byrnes’s Title VII claims alleged that Defendants (1) fired and (2) unfairly reviewed and reported four of his cases to the KBHA in retaliation for the sexual harassment complaint. 2 He also brought state law claims.\n\n       Defendants moved for summary judgment. The district court found Dr. Byrnes could not meet his burden on either Title VII retaliation claim and granted summary judgment to Defendants. It also declined to exercise supplemental jurisdiction over his state law claims.\n\n       Dr. Byrnes timely appealed."
}