{
  "overall_outcome": "REVERSE",
  "issues": [
    {
      "issue_id": 1,
      "description": "Whether the district court erred in remanding Maine's non-AFFF PFAS contamination suit to state court on the ground that 3M lacked a colorable federal defense under the federal officer removal statute (28 U.S.C. § 1442(a)(1)) due to Maine's disclaimer of AFFF-related claims.",
      "standard_of_review": "de novo",
      "holding": "REVERSE",
      "key_reasoning": "The First Circuit held that 3M plausibly alleged commingling of PFAS contamination from AFFF (for which it has a federal contractor defense) and non-AFFF sources, making the federal defense colorable and entitling 3M to a federal forum. Maine's disclaimer was not an express waiver under circuit precedent, as it would require a state court to determine the nexus between the charged conduct and federal authority, which is impermissible under federal officer removal doctrine."
    }
  ],
  "key_precedents": [
    "Mesa v. California, 489 U.S. 121 (1989)",
    "Jefferson County v. Acker, 527 U.S. 423 (1999)",
    "Government of Puerto Rico v. Express Scripts, Inc., 119 F.4th 174 (1st Cir. 2024)",
    "Moore v. Electric Boat Corp., 25 F.4th 30 (1st Cir. 2022)",
    "Willingham v. Morgan, 395 U.S. 402 (1969)"
  ],
  "difficulty_signals": {
    "novel_legal_question": true,
    "circuit_split": true,
    "close_case": false,
    "fact_intensive": true
  },
  "has_dissent": false,
  "summary_text": "Seeking redress for the effects of forever chemicals on the environment, the State of Maine brought two almost-identical suits against 3M Company, alleging that per- and polyfluoroalkyl substances (PFAS) made by 3M had contaminated resources \"in locations throughout Maine.\" Maine alleged that 3M's PFAS contaminated Maine's groundwaters, surface waters, wetlands, drinking water supplies, and other natural resources including the State's fish, wildlife, biota, air, soil, and sediment. Maine sought wide-ranging relief, including compensatory and punitive damages, investigation and monitoring costs, and incurred expenses for contamination remediation and natural resource restoration.\n\nMaine chose to file in its state court these two PFAS complaints on March 29, 2023. In one suit, Maine sought to recover for PFAS contamination caused by 3M's production of Aqueous Film Forming Foam (\"AFFF\"), a firefighting material that contains PFAS (the \"AFFF Complaint\"), while in the other, Maine sought to recover for PFAS contamination not caused by 3M's production of AFFF (the \"non-AFFF Complaint\"). Some AFFF was produced at the instruction of the U.S. military (\"MilSpec AFFF\") and has been used at military facilities in Maine and elsewhere. If Maine had sued 3M for PFAS in a single lawsuit, that suit would have readily been removed to federal court because the PFAS contamination included PFAS contained in AFFF, which 3M manufactured and sold to various private and government clients. But Maine chose to bring two suits, one expressly seeking recovery for PFAS contamination deriving from 3M's production of AFFF, while purporting to disclaim all AFFF-related recovery in the non-AFFF suit. Maine sought to avoid removal to federal court pursuant to the federal officer removal statute of what it calls the non-AFFF Complaint by including this disclaimer:\n\n     \"The State is not seeking to recover through this Complaint any relief for contamination or injury related to Aqueous Film Forming Foam [\"AFFF\" or \"MilSpec AFFF\"], a firefighting material that contains PFAS.\"\n\nCompl. ¶ 15. The disclaimer applies, Maine says, to both 3M's MilSpec AFFF and other AFFF.\n\nDefendant 3M removed both cases to federal court under the federal officer removal statute, 28 U.S.C. § 1442(a)(1). Maine did not oppose removal of its other suit seeking recovery for PFAS contamination deriving from 3M's production of AFFF. Maine opposed the removal of this non-AFFF case on the grounds, inter alia, that the disclaimer in its Complaint meant that 3M no longer would have a colorable federal defense, as required under the removal statute.\n\nThe federal district court agreed with Maine and remanded, reasoning that, by its disclaimer, \"the State has taken upon itself the burden as part of its case to demonstrate that the source of contamination in its [n]on-AFFF lawsuit is not a[n] AFFF source.\" Maine v. 3M Co., No. 2:23-CV-00210-JAW, 2023 WL 4758816, at *10 (D. Me. July 26, 2023). On remand to the state court, \"[i]f the factfinder concludes that the State has failed to meet its burden concerning the source, 3M will prevail.\" Id. Based on this reasoning, the district court concluded that the disclaimer \"effectively means that the federal officer defense will not be applicable in the State’s [n]on-AFFF lawsuit.\" Id.\n\nFor the reasons which follow, we conclude the remand order was error. Maine's efforts to have two courts answer the same questions must fail. For example, these questions include whether PFAS contamination has commingled with AFFF contamination and so was caused largely or in part by AFFF. We instruct the district court to order this removed non-AFFF case be promptly returned from the State of Maine Superior Court for Cumberland County to the U.S. District Court, which must resume jurisdiction over the case for further proceedings. If 3M moves to transfer this case, including to the ongoing In re: Aqueous Film-Forming Foam Products Liability Litigation (MDL No. 2873) in the U.S. District Court for the District of South Carolina, and the Judicial Panel on Multidistrict Litigation chooses to transfer this case, then further proceedings will occur in that federal court. The disclaimer does not render 3M's federal defense not \"colorable.\" Further, 3M is entitled, under the removal statute, to have a federal court decide the issues which the district court erroneously reasoned the state court would decide."
}